require File.join(File.dirname(__FILE__), '../lib/rseg')
require 'benchmark'

auto_input = %(竞购沃尔沃已到赛点，吉利离撞线一步之遥。

吉利高管出语越发谨慎。11月27日，吉利新闻发言人袁小林回答媒体提问时，对诸多问题都点到即止。

但有一点他说得非常明确：吉利的标的是沃尔沃轿车公司100%股权。记者从相关渠道获悉，这是李书福与沃尔沃谈判的底线。更为关键的是，吉利将通过沃尔沃拥有关键的技术和知识产权的所有权。而100%控股的同时又获得核心技术资源，恰是吉利收购沃尔沃与腾中收购悍马最大的不同。

显然，这个谈判方程式只有一个解，但未知数却很多。能体现李书福与诸多利益方斡旋的一个细节是，11月16日，李书福从北京转道伦敦，前往比利时和瑞典，分别拜会两国分管工业和能源的副首相，以及两国工会领导人和沃尔沃管理层。

而冲刺区仍有潜伏者。本报记者近日获悉，两家基金加入竞购沃尔沃的战团。一家来自瑞典，由沃尔沃的高管及瑞典汽车工会领导人等组成;一家是由福特汽车前董事组成的CROWN基金。

这是谈判对手故布疑阵还是另有玄机?只盯着后视镜显然得不到答案。

唯一明确的是，拥有黄金机会的中国市场是吉利最大底牌，这足以令李书福坐在竞购战车正驾驶的位置。

底线与底牌

11月27日，袁小林对记者表示，双方正就相关合同和条款进行细化和深谈，谈判进展顺利。

李书福此次赴欧，是向利益相关方介绍有关情况，同时也进一步了解了政府、工会代表们对并购案一些想法，如员工如何安置、养老金如何处置等关键问题。比利时和瑞典，是沃尔沃两个欧洲工厂的所在国。

在吉利与福特谈判进程中，知识产权问题一直是外界关注的焦点。

袁小林明确表示，首先，吉利是福特首选的竞购方，收购的标的是沃尔沃轿车公司100%的股权;其次，沃尔沃将保有其关键技术和知识产权的所有权，以及公司为实施既定商业计划所需要的所有福特知识产权的使用权;另外，吉利将通过沃尔沃拥有其关键技术和知识产权的所有权，并有权使用大量的知识产权，包括沃尔沃的安全与环保方面的知识产权。

记者从相关渠道了解到，“收购沃尔沃轿车公司100%股权”，是李书福谈判的底线。这是去年上汽退出韩国双龙，给李书福提的醒——不参股和控股，必须完全收购。

李书福何以有如此底气?

业内人士表示，相比国外竞购者，中国市场是吉利最大的底牌。

“对沃尔沃而言，吉利最大的优势是在中国的机会。其实设厂和100万台产量这种数字还只是一种口号，并不是最实际的优势。而且对于沃尔沃说，吉利带来的资金并不算最多。沃尔沃和福特看中的，应该是整个中国市场的发展机会。”消息人士说。

他认为，福特汽车并不是只想将沃尔沃脱手转售，而是背后还有更深层次的对“中国市场”的考量。“福特目前到底是想把沃尔沃彻底卖了，还是保留一部分股权，从而形成一个福特-吉利-沃尔沃的三方联盟体。目前我们还看不清楚。”

“如果是第二种合作方式，对于李书福来说，其实福特汽车才有更大的机会。”他点评说。

但显然，这种合作方式已被吉利排除在外。

“现在底特律普遍的质疑是，吉利是否有相应的人才可以吃下沃尔沃。买得下，管不管得好，是最大的挑战。”底特律商会的谭明安会长在接受本报记者采访时说。

另外，连福特都没办法解决掉的深层次问题，对于贸然进入欧洲的吉利来说，是否可以在最快时间内找到真正可以“解题”的方法，是一个极大的挑战。

两只基金加入竞争

蛇吞象的问题显然有点考虑过早。

有两只基金不想让吉利笑到最后。

据消息人士透露，一只收购基金来自瑞典国内。“其主要人员是沃尔沃的高管，与瑞典汽车工会的领导人，再加上平时与沃尔沃有相当业务关系的金融机构组成的。这个财团有很强的瑞典本地背景。”

消息人士指出，有一点可以看出，因为工会人员并非是来自沃尔沃工厂，而是来自瑞典全国性的汽车工会的高层，所以这个基金的出发点并非是简单的管理层收购，而是从本地民族产业和瑞典汽车产业出发，颇具“民族主义”色彩。这只基金的优势是在瑞典本地有极强的游说和政治力量。

据记者查找相关资料，这一只基金很有可能是沃尔沃工程师工会和其它瑞典全国性工会联合组织的一只基金。沃尔沃工程师工会由1800名工程师组成。但是无法找到该基金的详细名称。

工会成员在瑞典的工作人口中占大多数。最强大的工会成员有数百万人之多。作为强大的票仓，现在的瑞典政府本身就得到了工会的支持而上台执政。同时，本质上，瑞典是一个社会主义高福利国家——整个国家征收的企业所得税和个人的所得税高达40%以上，同时政府用这些税金为国民提供了非常强大的社会安全网。

在强势政府和强势的工会下，企业与两者之间的谈判地位，与美国的汽车产业就很不一样。

“另外一个则是福特汽车公司曾经的全球董事。他对沃尔沃非常熟悉。所以由他来领头组织了一个收购基金。这个基金有美国背景，同时在汽车行业内有深厚的人脉关系。”消息人士指出。

经记者查询，这家公司名为CROWN，由前福特董事Michael Dingman组建。CROWN将在下周一正式出价，据传报价将在20-25亿美元之间，略高于吉利目前的报价。

跨大西洋(600558)出动的CROWN基金有可能是从产业角度出发，看中沃尔沃的品牌和产品力。因为领军人士本身就是福特的前高管，对沃尔沃极其了解，深知沃尔沃的内部价值所在，而有了收购的想法。

对于两只基金参与收购的消息，记者联系到李书福，其态度很干脆，“我们参与公平竞争”。)

input = %(天津网-城市快报11月29日报道 第46届金马奖颁奖礼于昨晚在台北落下帷幕，颁奖典礼由台湾主持人陶晶莹独挑大梁，也开创了金马奖“一人主持”的先例。最终，台湾本土影片《不能没有你》凭5个重要大奖成为当晚的大赢家。第二次来参加金马奖的李冰冰，不负众望凭借《风声》成为新科影后，泪洒领奖台；张家辉、黄渤分别凭借《证人》《斗牛》荣获最佳男主角，这也是金马奖有史以来第一次出现“双影帝”；于少群获得最佳新演员；最佳男女配角则分别成为惠英红及王学圻的囊中物。本土热门戴立忍获得最佳导演奖，接过史无前例的由四位金马奖导演李安、关锦鹏、杜琪峰和侯孝贤共同颁发的奖杯，戴立忍也忍不住弹下了男儿泪。最后揭晓的是由张曼玉颁发的“最佳剧情片”，也肥水不流外人田的被台湾电影《不能没有你》获得。

　　护犊子 肥水不流外人田

　　台湾本土影片《不能没有你》成最大赢家

　　在金马奖颁奖典礼前一晚，金马奖组委会已经在台北举办了入围获奖者欢迎酒会，并提前颁发了费比西影评人奖和金马奖观众票选最佳影片奖。台湾影片《阳阳》和《不能没有你》分别获得这两项大奖，金马奖组委会主席侯孝贤和著名影星舒淇担任当晚的颁奖嘉宾，也给台湾电影在本届金马奖获奖开了个好头。昨晚，惠英红凭借《心魔》获得最佳女配角，《脸》获得最佳美术设计和最佳造型设计，《片刻暖和》获最佳创作短片。《不能没有你》则一举夺得最佳影片奖、最佳原著剧本奖和最佳导演奖等五项大奖，成为当晚的最大赢家。

　　明眼人都看在眼里，金马奖在一定程度上对本土电影进行了扶持。台湾电影金马奖，自从台湾本土电影没落以后，选出的佳作寥寥，早不得人心。这些年来，内地影片《阳光灿烂的日子》《可可西里》勇得大奖，香港片《功夫》《投名状》更横扫金马奖。但去年《投名状》力压台湾票房冠军《海角七号》，传闻令本土影迷十分不满。但随着《悲情城市》导演侯孝贤担当金马主席，且首先招回了声称再也不进金马奖的导演蔡明亮，不免让人产生疑问，第46届金马奖组委会在照顾台湾影片。

　　最佳影片最佳导演两项提名上，《南京！南京！》《风声》《梅兰芳》三部颇受好评作品，竟全无提名，明摆着将重量级作品打入冷宫，为台湾片开道。最可悲在于《新宿事件》《变节》《金钱帝国》《窃听风云》《神枪手》《灵灵狗》《夜·店》等诚意作品，彻底落败，愣是一个提名都没捞到，颇令人大跌眼镜。港片遗留下《证人》《叶问》少数作品，即便最佳男主角最佳动作指导全中，也甚难有突破。反观台湾地区，《不能没有你》《脸》《如梦》提名如此全面，明摆着是将大奖提前相送，莫非是不要硬给“脸”？

　　破天荒 金马奖首次诞下“双胞胎”

　　张家辉 黄渤双影帝 内地影片大放异彩

　　值得一提的是，今年的金马奖居然产下两个影帝，成为继金鸡奖“双黄蛋”后的“双胞胎”，成就了金马奖历史上的第一次。由于本届入围的影片中，内地电影占据了半壁江山，内地电影人此次也是大部队赶赴台湾参加金马奖，而台湾本地的影迷也给予了内地电影人最高的礼遇，红地毯上随处可见支持内地电影的海报和标语。

　　当晚，内地电影人也没有让大家失望，不仅在颁奖环节表现得优雅自如，在表演环节也制造惊喜，尤其是黄渤演唱的那首即兴改编的《太委屈》，博得主持人也是该曲原唱的陶晶莹以及在座嘉宾的一致好评。在奖项方面，内地电影人也收获颇丰。影片《斗牛》获得最佳改编剧本，《疯狂的赛车》获得最佳视觉效果，《李米的猜想》获得最佳原创电影音乐，《米香》主题曲《遇见》获得最佳原创电影歌曲，《南京！南京！》获最佳摄影奖。李冰冰凭借《风声》获得最佳女主角，泪洒领奖台。黄渤与张家辉共同获得最佳男主角。凭借电影《梅兰芳》获得最佳新人奖的余少群则表示，这可能是自己拿到的最后一个新人奖，金马奖为自己的新人道路画上了一个完美的句号。同时凭借该片获得最佳男配角的王学圻则缺席。

　　香港影片虽然在提名数量上不占优势，但是却获奖概率很高。除了《证人》获最佳男主角以外， 《叶问》获得最佳武打设计奖，《音乐人生》分别获得最佳剪辑、最佳音效和最佳纪录片三项大奖。

　　陶晶莹主持受肯定

　　去年由陈建州和郑裕玲搭档主持的金马奖，因为过于严肃受到影迷的批评，也对本届主持人提出了更高的要求。最终，陶晶莹独自接过重任，也开创了金马奖“一人主持”的先例。

　　这是陶晶莹睽违9年，第3次接下金马主持工作。但是身旁没有男性搭档，自己一人撑大局还是头一遭。对此，陶晶莹表示会紧张，但是并不担心，“我是炒菜的人，节奏明快、流程顺畅是第一考虑，然后再找几个好朋友来陪我。”当晚，她也确实有“抽点”台下的电影人上来和自己对话，其中与《疯狂赛车》中的台湾演员九孔、戎祥的一段关于“牛鬼蛇神”的对话， 最有“笑”果。

　　典礼结束后，金马影展主席侯孝贤夸陶晶莹能力无可取代，陶晶莹谦称大家太把荣耀加诸在她个人身上，其实都是靠团队努力的结果。

　　值得一提的还有，为了这次的颁奖典礼，陶晶莹一直积极减肥，一度令老公感到心疼，不断劝她多吃点。但她十分有毅力，并如愿以历史最瘦身材来完成本次主持。)

Benchmark.bm do |x|
  x.report('loading') { words = Rseg.segment('loading') }
  x.report('auto') { 100.times do words = Rseg.segment(auto_input) end }
end

puts auto_input.chars.to_a.length * 100


