require File.join(File.dirname(__FILE__), '../lib/rseg')

input = %(天津网-城市快报11月29日报道 第46届金马奖颁奖礼于昨晚在台北落下帷幕，颁奖典礼由台湾主持人陶晶莹独挑大梁，也开创了金马奖“一人主持”的先例。最终，台湾本土影片《不能没有你》凭5个重要大奖成为当晚的大赢家。第二次来参加金马奖的李冰冰，不负众望凭借《风声》成为新科影后，泪洒领奖台；张家辉、黄渤分别凭借《证人》《斗牛》荣获最佳男主角，这也是金马奖有史以来第一次出现“双影帝”；于少群获得最佳新演员；最佳男女配角则分别成为惠英红及王学圻的囊中物。本土热门戴立忍获得最佳导演奖，接过史无前例的由四位金马奖导演李安、关锦鹏、杜琪峰和侯孝贤共同颁发的奖杯，戴立忍也忍不住弹下了男儿泪。最后揭晓的是由张曼玉颁发的“最佳剧情片”，也肥水不流外人田的被台湾电影《不能没有你》获得。

　　护犊子 肥水不流外人田

　　台湾本土影片《不能没有你》成最大赢家

　　在金马奖颁奖典礼前一晚，金马奖组委会已经在台北举办了入围获奖者欢迎酒会，并提前颁发了费比西影评人奖和金马奖观众票选最佳影片奖。台湾影片《阳阳》和《不能没有你》分别获得这两项大奖，金马奖组委会主席侯孝贤和著名影星舒淇担任当晚的颁奖嘉宾，也给台湾电影在本届金马奖获奖开了个好头。昨晚，惠英红凭借《心魔》获得最佳女配角，《脸》获得最佳美术设计和最佳造型设计，《片刻暖和》获最佳创作短片。《不能没有你》则一举夺得最佳影片奖、最佳原著剧本奖和最佳导演奖等五项大奖，成为当晚的最大赢家。

　　明眼人都看在眼里，金马奖在一定程度上对本土电影进行了扶持。台湾电影金马奖，自从台湾本土电影没落以后，选出的佳作寥寥，早不得人心。这些年来，内地影片《阳光灿烂的日子》《可可西里》勇得大奖，香港片《功夫》《投名状》更横扫金马奖。但去年《投名状》力压台湾票房冠军《海角七号》，传闻令本土影迷十分不满。但随着《悲情城市》导演侯孝贤担当金马主席，且首先招回了声称再也不进金马奖的导演蔡明亮，不免让人产生疑问，第46届金马奖组委会在照顾台湾影片。

　　最佳影片最佳导演两项提名上，《南京！南京！》《风声》《梅兰芳》三部颇受好评作品，竟全无提名，明摆着将重量级作品打入冷宫，为台湾片开道。最可悲在于《新宿事件》《变节》《金钱帝国》《窃听风云》《神枪手》《灵灵狗》《夜·店》等诚意作品，彻底落败，愣是一个提名都没捞到，颇令人大跌眼镜。港片遗留下《证人》《叶问》少数作品，即便最佳男主角最佳动作指导全中，也甚难有突破。反观台湾地区，《不能没有你》《脸》《如梦》提名如此全面，明摆着是将大奖提前相送，莫非是不要硬给“脸”？

　　破天荒 金马奖首次诞下“双胞胎”

　　张家辉 黄渤双影帝 内地影片大放异彩

　　值得一提的是，今年的金马奖居然产下两个影帝，成为继金鸡奖“双黄蛋”后的“双胞胎”，成就了金马奖历史上的第一次。由于本届入围的影片中，内地电影占据了半壁江山，内地电影人此次也是大部队赶赴台湾参加金马奖，而台湾本地的影迷也给予了内地电影人最高的礼遇，红地毯上随处可见支持内地电影的海报和标语。

　　当晚，内地电影人也没有让大家失望，不仅在颁奖环节表现得优雅自如，在表演环节也制造惊喜，尤其是黄渤演唱的那首即兴改编的《太委屈》，博得主持人也是该曲原唱的陶晶莹以及在座嘉宾的一致好评。在奖项方面，内地电影人也收获颇丰。影片《斗牛》获得最佳改编剧本，《疯狂的赛车》获得最佳视觉效果，《李米的猜想》获得最佳原创电影音乐，《米香》主题曲《遇见》获得最佳原创电影歌曲，《南京！南京！》获最佳摄影奖。李冰冰凭借《风声》获得最佳女主角，泪洒领奖台。黄渤与张家辉共同获得最佳男主角。凭借电影《梅兰芳》获得最佳新人奖的余少群则表示，这可能是自己拿到的最后一个新人奖，金马奖为自己的新人道路画上了一个完美的句号。同时凭借该片获得最佳男配角的王学圻则缺席。

　　香港影片虽然在提名数量上不占优势，但是却获奖概率很高。除了《证人》获最佳男主角以外， 《叶问》获得最佳武打设计奖，《音乐人生》分别获得最佳剪辑、最佳音效和最佳纪录片三项大奖。

　　陶晶莹主持受肯定

　　去年由陈建州和郑裕玲搭档主持的金马奖，因为过于严肃受到影迷的批评，也对本届主持人提出了更高的要求。最终，陶晶莹独自接过重任，也开创了金马奖“一人主持”的先例。

　　这是陶晶莹睽违9年，第3次接下金马主持工作。但是身旁没有男性搭档，自己一人撑大局还是头一遭。对此，陶晶莹表示会紧张，但是并不担心，“我是炒菜的人，节奏明快、流程顺畅是第一考虑，然后再找几个好朋友来陪我。”当晚，她也确实有“抽点”台下的电影人上来和自己对话，其中与《疯狂赛车》中的台湾演员九孔、戎祥的一段关于“牛鬼蛇神”的对话， 最有“笑”果。

　　典礼结束后，金马影展主席侯孝贤夸陶晶莹能力无可取代，陶晶莹谦称大家太把荣耀加诸在她个人身上，其实都是靠团队努力的结果。

　　值得一提的还有，为了这次的颁奖典礼，陶晶莹一直积极减肥，一度令老公感到心疼，不断劝她多吃点。但她十分有毅力，并如愿以历史最瘦身材来完成本次主持。)

words = Rseg.segment(input)
puts words.join('  ')
